# -----------------завдання 1-----------

# text = ("Кава — один із найпопулярніших напоїв у світі. Вона дарує енергію, піднімає настрій і допомагає розпочати день. Дослідження показують, що помірне споживання кави може бути навіть корисним! Ви любите каву?")
# count_dots=text.count(".")+text.count("?")+text.count("!")
# print(f"Кількість речень в тексті: {count_dots}")

# -----------------завдання 2-----------

# word = input("Введіть рядок: ")
# if word:
#     word = word[0].lower() + word[1:]
# if word == word[::-1]:
#     print(f"{word} - це паліндром")
# else:
#     print(f"{word} - не паліндром")

# -----------------завдання 3-----------

# word = input("Введіть рядок: ")

